apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_spi.c
  /* Initialize GDMA controller */

  esp32c3_dma_init();

  /* Request a GDMA channel for SPI peripheral */

  priv->dma_channel = esp32c3_dma_request(ESP32C3_DMA_PERIPH_SPI, 1, 1,
                                          true);
  if (priv->dma_channel < 0)
    {
      spierr("Failed to allocate GDMA channel\n");

      DEBUGPANIC();
    }

  /* Disable segment transaction mode for SPI Master */

  putreg32((SPI_SLV_RX_SEG_TRANS_CLR_EN_M | SPI_SLV_TX_SEG_TRANS_CLR_EN_M),
           SPI_DMA_CONF_REG);
}
#endif

/****************************************************************************
 * Name: esp32c3_spi_init
 *
 * Description:
 *   Initialize ESP32-C3 SPI hardware interface.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_spi_init(struct spi_dev_s *dev)
{
  struct esp32c3_spi_priv_s *priv = (struct esp32c3_spi_priv_s *)dev;
  const struct esp32c3_spi_config_s *config = priv->config;
  uint32_t regval;

  esp32c3_gpiowrite(config->cs_pin, true);
  esp32c3_gpiowrite(config->mosi_pin, true);
  esp32c3_gpiowrite(config->miso_pin, true);
  esp32c3_gpiowrite(config->clk_pin, true);

#if SPI_HAVE_SWCS
  esp32c3_configgpio(config->cs_pin, OUTPUT_FUNCTION_1);
  esp32c3_gpio_matrix_out(config->cs_pin, SIG_GPIO_OUT_IDX, 0, 0);
#endif

#if SPI_VIA_IOMUX
#if !SPI_HAVE_SWCS
  esp32c3_configgpio(config->cs_pin, OUTPUT_FUNCTION_2);
  esp32c3_gpio_matrix_out(config->cs_pin, SIG_GPIO_OUT_IDX, 0, 0);
#endif
  esp32c3_configgpio(config->mosi_pin, OUTPUT_FUNCTION_2);
  esp32c3_gpio_matrix_out(config->mosi_pin, SIG_GPIO_OUT_IDX, 0, 0);

  esp32c3_configgpio(config->miso_pin, INPUT_FUNCTION_2 | PULLUP);
  esp32c3_gpio_matrix_out(config->miso_pin, SIG_GPIO_OUT_IDX, 0, 0);

  esp32c3_configgpio(config->clk_pin, OUTPUT_FUNCTION_2);
  esp32c3_gpio_matrix_out(config->clk_pin, SIG_GPIO_OUT_IDX, 0, 0);
#else
#if !SPI_HAVE_SWCS
  esp32c3_configgpio(config->cs_pin, OUTPUT_FUNCTION_1);
  esp32c3_gpio_matrix_out(config->cs_pin, config->cs_outsig, 0, 0);
#endif
  esp32c3_configgpio(config->mosi_pin, OUTPUT_FUNCTION_1);
  esp32c3_gpio_matrix_out(config->mosi_pin, config->mosi_outsig, 0, 0);

  esp32c3_configgpio(config->miso_pin, INPUT_FUNCTION_1 | PULLUP);
  esp32c3_gpio_matrix_in(config->miso_pin, config->miso_insig, 0);

  esp32c3_configgpio(config->clk_pin, OUTPUT_FUNCTION_1);
  esp32c3_gpio_matrix_out(config->clk_pin, config->clk_outsig, 0, 0);
#endif

  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0, config->clk_bit);
  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, config->rst_bit, 0);

  regval = SPI_DOUTDIN_M | SPI_USR_MISO_M | SPI_USR_MOSI_M | SPI_CS_HOLD_M;
  putreg32(regval, SPI_USER_REG);
  putreg32(0, SPI_USER1_REG);
  putreg32(0, SPI_SLAVE_REG);
  putreg32(SPI_CS1_DIS_M | SPI_CS2_DIS_M, SPI_MISC_REG);

  regval = SPI_CLK_EN_M | SPI_MST_CLK_ACTIVE_M | SPI_MST_CLK_SEL_M;
  putreg32(regval, SPI_CLK_GATE_REG);

#if SPI_HAVE_SWCS
  esp32c3_spi_set_regbits(SPI_MISC_REG, SPI_CS0_DIS_M);
#endif

  putreg32(0, SPI_CTRL_REG);
  putreg32(VALUE_MASK(0, SPI_CS_HOLD_TIME), SPI_USER1_REG);

#ifdef CONFIG_ESP32C3_SPI2_DMA
  esp32c3_spi_dma_init(dev);
#endif

  esp32c3_spi_setfrequency(dev, config->clk_freq);
  esp32c3_spi_setbits(dev, config->width);
  esp32c3_spi_setmode(dev, config->mode);
}

/****************************************************************************
 * Name: esp32c3_spi_deinit
 *
 * Description:
 *   Deinitialize ESP32-C3 SPI hardware interface.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32c3_spi_deinit(struct spi_dev_s *dev)
{
  struct esp32c3_spi_priv_s *priv = (struct esp32c3_spi_priv_s *)dev;

#ifdef CONFIG_ESP32C3_SPI2_DMA
  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, priv->config->dma_clk_bit, 0);
#endif

  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, 0, priv->config->clk_bit);
  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, priv->config->clk_bit, 0);

  priv->frequency = 0;
  priv->actual    = 0;
  priv->mode      = SPIDEV_MODE0;
  priv->nbits     = 0;
}

/****************************************************************************
 * Name: esp32c3_spi_interrupt
 *
 * Description:
 *   Common SPI DMA interrupt handler.
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info
 *   arg     - SPI controller private data
 *
 * Returned Value:
 *   Standard interrupt return value.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32C3_SPI2_DMA
static int esp32c3_spi_interrupt(int irq, void *context, void *arg)
{
  struct esp32c3_spi_priv_s *priv = (struct esp32c3_spi_priv_s *)arg;

  esp32c3_spi_clr_regbits(SPI_DMA_INT_RAW_REG, SPI_TRANS_DONE_INT_RAW_M);
  nxsem_post(&priv->sem_isr);

  return 0;
}
#endif

/****************************************************************************
 * Name: esp32c3_spibus_initialize
 *
 * Description:
 *   Initialize the selected SPI bus.
 *
 * Input Parameters:
 *   port     - Port number (for hardware that has multiple SPI interfaces)
 *
 * Returned Value:
 *   Valid SPI device structure reference on success; NULL on failure.
 *
 ****************************************************************************/

struct spi_dev_s *esp32c3_spibus_initialize(int port)
{
  struct spi_dev_s *spi_dev;
  struct esp32c3_spi_priv_s *priv;

  switch (port)
    {
#ifdef CONFIG_ESP32C3_SPI2
      case ESP32C3_SPI2:
        priv = &esp32c3_spi2_priv;
        break;
#endif
      default:
        return NULL;
    }

  spi_dev = (struct spi_dev_s *)priv;

  nxmutex_lock(&priv->lock);
  if (priv->refs != 0)
    {
      priv->refs++;
      nxmutex_unlock(&priv->lock);
      return spi_dev;
    }

#ifdef CONFIG_ESP32C3_SPI2_DMA
  if (priv->cpuint != -ENOMEM)
    {
      /* Disable the provided CPU Interrupt to configure it. */

